<center><font size="4"><u>This is a jupyter notebook. Use <b>Shift + Enter</b> to run the current cell </u></font></center>

In [1]:
import pandas as pd                       # This line is used to import pandas library. 
                                          # Pandas is a long word to use, that's why use it "as pd"

In [2]:
dataframe = pd.read_csv("students.csv")   # Reading/Opening a csv(comma separated values) file (table like)

In [3]:
dataframe                                 #Table inside the csv file {Column -> Type : Credit/Audit}

      Name Gender  Marks Type
0    Shyam      M     76    C
1    Mohan      M     74    A
2   Ramesh      F     47    C
3  Stanzin      F     89    C
4   Rajesh      M     55    C
5   Parker      M     45    A
6   Mukesh      F     34    C
7    Soham      M     78    A
8    Milan      F     91    A

In [4]:
print (dataframe.head())                     # Prints out the first 5 data rows

      Name Gender  Marks Type
0    Shyam      M     76    C
1    Mohan      M     74    A
2   Ramesh      F     47    C
3  Stanzin      F     89    C
4   Rajesh      M     55    C

In [5]:
df = dataframe                               # Shorten the name
len(df)

9

<center><font size="4"><u>To select a particular column</u></font></center>

In [6]:
mark_col = dataframe['Marks']               # Or use df.Marks....Try that!!!

In [7]:
mark_col                                    # Try type(mark_col)

0    76
1    74
2    47
3    89
4    55
5    45
6    34
7    78
8    91
Name: Marks, dtype: int64

In [8]:
mark_list = list (mark_col)                  # Make it python list

<center><font size="4">Subset Dataframe with desired columns</font></center>

In [9]:
df[['Name', 'Marks']]

      Name  Marks
0    Shyam     76
1    Mohan     74
2   Ramesh     47
3  Stanzin     89
4   Rajesh     55
5   Parker     45
6   Mukesh     34
7    Soham     78
8    Milan     91

<center><font size="4"><u>Filtering the dataframe</u></font></center>

In [10]:
# Step 1
df['Marks']>55                 # Conditioned statement: Return boolean

0     True
1     True
2    False
3     True
4    False
5    False
6    False
7     True
8     True
Name: Marks, dtype: bool

In [11]:
# Step 2
df[df['Marks']>55]             # Filtering the "True" data out of dataframe

      Name Gender  Marks Type
0    Shyam      M     76    C
1    Mohan      M     74    A
3  Stanzin      F     89    C
7    Soham      M     78    A
8    Milan      F     91    A

In [12]:
(df.Gender=='M') & (df.Marks>50)  # Applying 2 conditions

0     True
1     True
2    False
3    False
4     True
5    False
6    False
7     True
8    False
dtype: bool

In [13]:
df[(df.Gender=='M') & (df.Marks>50)]     # Filtered Male student with greater than 50 marks

     Name Gender  Marks Type
0   Shyam      M     76    C
1   Mohan      M     74    A
4  Rajesh      M     55    C
7   Soham      M     78    A

In [14]:
df                                       # What? no change!!!!

      Name Gender  Marks Type
0    Shyam      M     76    C
1    Mohan      M     74    A
2   Ramesh      F     47    C
3  Stanzin      F     89    C
4   Rajesh      M     55    C
5   Parker      M     45    A
6   Mukesh      F     34    C
7    Soham      M     78    A
8    Milan      F     91    A

In [15]:
df2 = df[(df.Gender=='M') & (df.Marks>50)]     # Need to assign the dataframe to a variable to retain it./

In [16]:
df2

     Name Gender  Marks Type
0   Shyam      M     76    C
1   Mohan      M     74    A
4  Rajesh      M     55    C
7   Soham      M     78    A

<center><font size="4"><u>Saving back to csv file</u></font></center>

In [17]:
df2.to_csv('filtered.csv')                     # Check your current working directory to find a new csv file.

<center><font size="4"><u>Selection : Just like 2-D array selection</u></font></center>

In [18]:
df.loc[4, 'Name']                              # Row = 4, Column = 'Name'

'Rajesh'

In [19]:
df.loc[[1,5,8], ['Name', 'Type']]              # Multiple Selection

     Name Type
1   Mohan    A
5  Parker    A
8   Milan    A

In [20]:
df3 = df.set_index('Name')

In [21]:
df3

        Gender  Marks Type
Name
Shyam        M     76    C
Mohan        M     74    A
Ramesh       F     47    C
Stanzin      F     89    C
Rajesh       M     55    C
Parker       M     45    A
Mukesh       F     34    C
Soham        M     78    A
Milan        F     91    A

In [22]:
df3.loc[['Shyam', 'Mohan'], ['Marks', 'Type']]

       Marks Type
Name
Shyam     76    C
Mohan     74    A

<font size="4"> To create a dataframe of your own, follow this simple<a ref="https://www.geeksforgeeks.org/different-ways-to-create-pandas-dataframe/"> link</a> 
</font></center><br>
<font size="4">Official Pandas documentation and <b>Stack overflow<\b> will surely help you for the rest </font></center>